tap "derailed/k9s"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
# Securely store and access AWS credentials in development environments
brew "aws-vault"
# Text processing system for reStructuredText
brew "docutils"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# X.Org: Library for common extensions to the X11 protocol
brew "libxext"
# Cross-platform make
brew "cmake"
# Load/unload environment variables based on $PWD
brew "direnv"
# .NET Core
brew "dotnet"
# Modern replacement for 'ls'
brew "exa"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# AVH edition of git-flow
brew "git-flow-avh"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Manage your Java environment
brew "jenv"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Pager program similar to more
brew "less"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk"
# 📦🚀 Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@14", restart_service: true
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Safe, concurrent, practical language
brew "rust"
# Rust toolchain installer
brew "rustup-init"
# Simple keystroke visualizer
brew "showkey"
# Cross-shell prompt for astronauts
brew "starship"
# Tool for managing your YubiKey configuration
brew "ykman"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Vault
brew "hashicorp/tap/vault"
# Memory training application
cask "anki"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Web browser focusing on privacy
cask "brave-browser"
# Standalone Chrome development tools
cask "chrome-devtools"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "firefox"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
# Web browser
cask "google-chrome"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Jellyfin desktop client
cask "jellyfin-media-player"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organized
cask "notion"
# Collaboration platform for API development
cask "postman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Music streaming service
cask "spotify"
# Customize mouse buttons, wheels and cursor speed
cask "steermouse"
# Customizable timing of breaks
cask "time-out"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
